IDEA StatiCa Open Model
Beam Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The Beam type exposes the following members.
Properties
Name | Description
CrossSectionBegin
 Gets, sets cross section located in the begining of this element1D
 (Inherited from Element1D.)
CrossSectionEnd
 Gets, sets cross section located at the end of this element1D
 (Inherited from Element1D.)
EccentricityBeginX
 Local eccentricity X at the begin of Element1D
 (Inherited from Element1D.)
EccentricityBeginY
 Local eccentricity Y at the begin of Element1D
 (Inherited from Element1D.)
EccentricityBeginZ
 Local eccentricity Z at the begin of Element1D
 (Inherited from Element1D.)
EccentricityEndX
 Local eccentricity X at the end of Element1D
 (Inherited from Element1D.)
EccentricityEndY
 Local eccentricity Y at the end of Element1D
 (Inherited from Element1D.)
EccentricityEndZ
 Local eccentricity Z at the end of Element1D
 (Inherited from Element1D.)
Edges
 Lines of Element2D including edges, which are created by opening
GeomId
 Id representing geometrical parts of Detail
Id
 Element Id
 (Inherited from OpenElementId.)
InsertPoint
 Insert point 0 - 9
MasterComponent
 Master component
MasterPoint
 Master point 0 - 9
Name
 Name of Element
 (Inherited from Element1D.)
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
RotationRx
 Rotation of Cross-section of Element1D. Difference from default Line LCS
 (Inherited from Element1D.)
Segment
 Line segment with start point and end point
 (Inherited from Element1D.)
Top
See Also
Reference
Beam Class
IdeaRS.OpenModel.Detail Namespace